## Staging: idp
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                     NAME                                     |
|----------|------------------------------------------------------------------------------|
| delete   | `module.user_portal_code_pipeline[0].aws_secretsmanager_secret.this`         |
|          | `module.user_portal_code_pipeline[0].aws_secretsmanager_secret_version.this` |
| update   | `module.idp_ecs.aws_ecs_service.this`                                        |
|          | `module.user_portal_code_pipeline[0].aws_codebuild_project.ecs_render`       |
| recreate | `module.idp_ecs.aws_ecs_task_definition.this`                                |
|          | `module.user_portal_code_pipeline[0].aws_codepipeline_webhook.this`          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.idp_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:687401027353:service/auth/zitadel"
        name                               = "zitadel"
        tags                               = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:687401027353:task-definition/zitadel:43" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.idp_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:687401027353:task-definition/zitadel:43" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:687401027353:task-definition/zitadel" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/zitadel:80ebfa19c53b36a0c70fe5419bd6580a7cde8044" -> "687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/zitadel:latest"
                    name                   = "zitadel"
                    # (11 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "zitadel" -> (known after apply)
      ~ revision                 = 43 -> (known after apply)
        tags                     = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ tags_all                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.user_portal_code_pipeline[0].aws_codebuild_project.ecs_render will be updated in-place
  ~ resource "aws_codebuild_project" "ecs_render" {
      ~ build_timeout          = 5 -> 10
        id                     = "arn:aws:codebuild:ca-central-1:687401027353:project/ECS-Render-idp_user_portal"
        name                   = "ECS-Render-idp_user_portal"
        tags                   = {}
        # (14 unchanged attributes hidden)

      ~ source {
          ~ buildspec           = jsonencode(
              ~ {
                  ~ phases    = {
                      ~ build      = {
                          ~ commands   = [
                              ~ "aws ecr get-login-password --region ca-central-1 | docker login --username AWS --password-stdin 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal" -> "export GIT_TAG=$(git tag --points-at $GIT_COMMIT_ID)",
                              ~ "docker build -t base ." -> "aws ecr get-login-password --region ca-central-1 | docker login --username AWS --password-stdin 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal",
                              ~ "docker tag base 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:latest" -> "docker build -t base  .",
                              ~ "docker push 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:latest" -> "docker tag base 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:latest",
                              ~ "docker tag base 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_COMMIT_ID" -> "docker push 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:latest",
                              ~ "docker push 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_COMMIT_ID" -> "docker tag base 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_COMMIT_ID",
                              ~ "export GIT_TAG=$(git tag --points-at $GIT_COMMIT_ID)" -> "docker push 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_COMMIT_ID",
                                "if [[ -n \"$GIT_TAG\" ]]; then docker tag base 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_TAG && docker push 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_TAG; fi",
                            ]
                            # (2 unchanged attributes hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }
                    # (3 unchanged attributes hidden)
                }
            )
            # (5 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.user_portal_code_pipeline[0].aws_codepipeline_webhook.this must be replaced
-/+ resource "aws_codepipeline_webhook" "this" {
      ~ arn             = "arn:aws:codepipeline:ca-central-1:687401027353:webhook:github-webhook-idp_user_portal" -> (known after apply)
      ~ id              = "arn:aws:codepipeline:ca-central-1:687401027353:webhook:github-webhook-idp_user_portal" -> (known after apply)
        name            = "github-webhook-idp_user_portal"
      - tags            = {} -> null
      ~ url             = "https://ca-central-1.webhooks.aws/trigger?t=eyJlbmNyeXB0ZWREYXRhIjoiOTRzMThqNkcvWFVibHh6cHFTRGVZV01XSkJPTWJGZklkMUtzZnV5cXJsMFUxeHE4MGlHeWpGeWhXTXRJU2ROMmhOOFNXMGxteFpoeWpPVHJuYXl1bC9VWEpOc3N5ZDJZRjhvL3JnOTE5Y0JiTWpyS0lHVy85cUxBWmsvZlVuQWtDK1pYMzNGUk1iZ3g1QmhIdHFIWlpHUVd5OGwxWllhcnFQWGZZOTEvUUN6dTNRPT0iLCJpdlBhcmFtZXRlclNwZWMiOiJZcU9Jbk9WTHhkMU5aVkdhIiwibWF0ZXJpYWxTZXRTZXJpYWwiOjF9&v=1" -> (known after apply)
        # (5 unchanged attributes hidden)

      - authentication_configuration { # forces replacement
          - secret_token     = (sensitive value) -> null # forces replacement
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.user_portal_code_pipeline[0].aws_secretsmanager_secret.this will be destroyed
  # (because aws_secretsmanager_secret.this is not in configuration)
  - resource "aws_secretsmanager_secret" "this" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:github-webhook-idp_user_portal_1-qxaksn" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:github-webhook-idp_user_portal_1-qxaksn" -> null
      - name                           = "github-webhook-idp_user_portal_1" -> null
      - recovery_window_in_days        = 0 -> null
      - region                         = "ca-central-1" -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "CostCentre" = "forms-platform-staging"
          - "Terraform"  = "true"
        } -> null
        # (4 unchanged attributes hidden)
    }

  # module.user_portal_code_pipeline[0].aws_secretsmanager_secret_version.this will be destroyed
  # (because aws_secretsmanager_secret_version.this is not in configuration)
  - resource "aws_secretsmanager_secret_version" "this" {
      - arn              = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:github-webhook-idp_user_portal_1-qxaksn" -> null
      - id               = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:github-webhook-idp_user_portal_1-qxaksn|terraform-20260114175833886700000003" -> null
      - region           = "ca-central-1" -> null
      - secret_id        = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:github-webhook-idp_user_portal_1-qxaksn" -> null
      - secret_string    = (sensitive value) -> null
      - secret_string_wo = (write-only attribute) -> null
      - version_id       = "terraform-20260114175833886700000003" -> null
      - version_stages   = [
          - "AWSCURRENT",
        ] -> null
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to change, 4 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/idp_database/rds/locals.tf line 14, in locals:
  14:   region        = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 2 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.idp_ecs.aws_service_discovery_service.this,
  on .terraform/modules/idp_ecs/ecs/service_discovery.tf line 15, in resource "aws_service_discovery_service" "this":
  15:     failure_threshold = 1

failure_threshold is deprecated. The argument is no longer supported by AWS
and the value is always set to 1. The attribute will be removed in a future
major version.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.idp_protocol_version"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.idp"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecs_xray"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.user_portal_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.user_portal_ssm"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.idp_user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.idp"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codebuild_project.ecs_render"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codedeploy_app.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codedeploy_deployment_group.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codepipeline.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codepipeline_webhook.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codestarconnections_connection.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_iam_role.this"]
WARN - plan.json...
```

</details>
